# -*- encoding=utf8 -*-
__author__ = "86177"

from airtest.core.api import *

auto_setup(__file__)

#小物体-几何-快速
touch((55,225)) 
touch((70,360)) 
touch((280,470)) 
touch((60,575)) 
touch((65,685)) 

#小物体-几何-高精度
touch((55,225)) 
touch((70,360)) 
touch((280,470)) 
touch((60,575)) 
touch((170,685)) 

#小物体-纹理-快速
touch((55,225)) 
touch((70,360)) 
touch((280,470))
touch((170,575))
touch((65,685)) 

#小物体-纹理-高精度
touch((55,225)) 
touch((70,360)) 
touch((280,470))
touch((170,575))
touch((170,685)) 

#小物体-标志点
touch((55,225)) 
touch((70,360)) 
touch((280,470))
touch((280,575))

#中物体-几何-快速
touch((55,225)) 
touch((70,360)) 
touch((175,465)) 
touch((70,570)) 
touch((65,685)) 

#中物体-几何-高精度
touch((55,225)) 
touch((70,360)) 
touch((175,465)) 
touch((70,570)) 
touch((170,685)) 

#中物体-纹理-快速
touch((55,225)) 
touch((70,360)) 
touch((175,465)) 
touch((175,570)) 
touch((65,685)) 

#中物体-纹理-高精度
touch((55,225)) 
touch((70,360)) 
touch((175,465)) 
touch((175,570)) 
touch((170,685)) 

#中物体-标志点
touch((55,225)) 
touch((70,360)) 
touch((175,465)) 
touch((280,570)) 

#大物体-几何-快速
touch((55,225)) 
touch((70,360)) 
touch((70,465))
touch((70,570)) 
touch((70,680)) 

#大物体-几何-高精度
touch((55,225)) 
touch((70,360)) 
touch((70,465))
touch((70,570)) 
touch((175,680)) 

#大物体-纹理-快速
touch((55,225)) 
touch((70,360)) 
touch((70,465))
touch((175,570)) 
touch((70,680)) 

#大物体-纹理-高精度
touch((55,225)) 
touch((70,360)) 
touch((70,465))
touch((175,570)) 
touch((175,680)) 

#大物体-标志点
touch((55,225)) 
touch((70,360)) 
touch((70,465))
touch((280,570))

#人脸-几何-快速
touch((55,225)) 
touch((175,360)) 
touch((70,465))
touch((60,575))

#人脸-几何-高精度
touch((55,225)) 
touch((175,360)) 
touch((70,465))
touch((170,575))

#人脸-纹理-快速
touch((55,225)) 
touch((175,360)) 
touch((175,465))
touch((60,575))

#人脸-纹理-高精度
touch((55,225)) 
touch((175,360)) 
touch((175,465))
touch((170,575))

#人体-几何-高精度
touch((55,225)) 
touch((280,360)) 
touch((70,465))
touch((175,570)) 

#人体-几何-快速
touch((55,225)) 
touch((280,360)) 
touch((70,465))
touch((70,570))

#人体-纹理-快速
touch((55,225)) 
touch((280,360)) 
touch((175,465))
touch((70,570))

#人体-纹理-高精度
touch((55,225)) 
touch((280,360)) 
touch((175,465))
touch((175,570)) 

#框架点-小物体
touch((65,250))
touch((280,355))

#框架点-中物体
touch((65,250))
touch((170,355))

#框架点-大物体
touch((65,250))
touch((60,355))


